УТ_для_edt.ДоставкаДеловыеЛинии/src/InformationRegisters/ДЛ_ХешиСправочников/ДЛ_ХешиСправочников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДЛ_ХешиСправочников</name>
  <resources>
    <name>Хеш</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ИмяСправочника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt.ДоставкаДеловыеЛинии/src/InformationRegisters/ДЛ_ХешиСправочников/ManagerModule.bsl
Функция ПолучитьХеш(ИмяСправочника) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ДЛ_ХешиСправочников.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ИмяСправочника = ИмяСправочника;
	МенеджерЗаписи.Прочитать();
	
	Возврат МенеджерЗаписи.Хеш; 
	
КонецФункции
